wsse-to-basic-auth-transformation-policy/src/test/resources/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><wsse:UsernameToken wsu:Id="UsernameToken-7"><wsse:Username>joe</wsse:Username><wsse:Password Type="wsse:PasswordText">secret</wsse:Password><wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">7AmwOhaFs9FJksXCVraaQw==</wsse:Nonce><wsu:Created>2016-01-14T11:52:06.385Z</wsu:Created></wsse:UsernameToken></wsse:Security></soap:Header><soap:Body><ns2:greet xmlns:ns2="http://security.example.mule.mulesoft.com/"><name>John</name></ns2:greet></soap:Body></soap:Envelope>